{
    "generated": "2025-09-14T14:42:34+01:00",
    "count": 30,
    "items": [
        {
            "source": "Glasgow Times | Celtic",
            "title": "Brian Dempsey tells Celtic hierarchy how they can restore fans&#039; faith",
            "link": "https://www.glasgowtimes.co.uk/sport/25465525.brian-dempsey-tells-current-celtic-board-must/?ref=rss",
            "date": 1757855358,
            "desc": "<p>The board have received widespread criticism in recent weeks, with supporters staging a protest at Rugby Park this afternoon.</p><p>Dempsey, who played a critical role in saving <a href=\"https://www.glasgowtimes.co.uk/sport/celtic\" target=\"_blank\" rel=\"noopener noreferrer\">Celtic</a> in the 1990s, believes change is needed at the top.</p><p>He told <a href=\"https://www.dailyrecord.co.uk/sport/football/football-news/celtic-dealmaker-reveals-dermot-desmond-35898215?ref=ed_direct\" target=\"_blank\" rel=\"noopener noreferrer\">RecordSport</a>: \"When an institution like Celtic loses the goodwill of the fans, then they are in trouble.</p><p>Read more:</p><p>\"They need to get it back quickly by being honest, sincere and genuine.</p><p>\"And the most urgent need is to convince the fans that the Celtic hierarchy does have ambition.</p><p>\"I would struggle to understand how the board can continue to oversee a situation where there is a lack of mutual respect between the club and the fans.\"</p><p>He said: \"The club are financially indebted to them and must never forget that.</p><p>\"The fans are now, as they were in 1994, the ones who make Celtic a viable company with their relentless purchase of season tickets, merchandising and everything else on offer from the club.</p><p>\"And yet we have come to a situation where there will be an organised boycott of the first 12 minutes of the game against Kilmarnock.\"</p>",
            "cats": "",
            "image": "https://www.glasgowtimes.co.uk/resources/images/19925523.jpg?type=og-image"
        },
        {
            "source": "GlasgowWorld Celtic",
            "title": "£5.5 deadline day signing makes debut: Celtic confirmed starting XI vs Kilmarnock for Rugby Park showdown",
            "link": "https://www.glasgowworld.com/sport/football/celtic/celtic-confirmed-starting-xi-kilmarnock-rugby-park-5316663",
            "date": 1757854779,
            "desc": "<p>Brendan Rodgers’ confirmed Celtic starting line-up to face Kilmarnock in their latest Scottish Premiership clash in East Ayrshire</p>",
            "cats": "Celtic, Football, Sport",
            "image": "fleg.jpg"
        },
        {
            "source": "Daily Record - Celtic FC",
            "title": "Kilmarnock vs Celtic LIVE  score and goal updates from the Premiership clash ",
            "link": "https://www.dailyrecord.co.uk/sport/football/football-news/kilmarnock-vs-celtic-live-score-35900420",
            "date": 1757851213,
            "desc": "<p>They aren't happy with what's happening off the pitch, but fed-up punters could see <a href=\"https://www.dailyrecord.co.uk/all-about/celtic-fc\" target=\"_blank\" rel=\"noopener noreferrer\">Celtic</a> open up a nine-point gap on their rivals with just five games played.</p><p><a href=\"https://www.dailyrecord.co.uk/all-about/rangers-fc\" target=\"_blank\" rel=\"noopener noreferrer\">Rangers</a> are deep in crisis mode after Saturday's 2-0 home defeat to Hearts left them 10th in the table and fans calling for Russell Martin to be sacked.</p><p>It's momentarily shifted the focus off of the Celtic board, their disappointing transfer window and <a href=\"https://www.dailyrecord.co.uk/all-about/brendan-rodgers\" target=\"_blank\" rel=\"noopener noreferrer\">Brendan Rodgers</a>' future.</p><p>But the pendulum always swings back in Scottish football and failure to capitalise on the shambles across the city will see the heat turned back up...and leave league leaders Hearts sitting pretty.</p><p>The away fans plan to enter Rugby park late for this afternoon's meeting with <a href=\"https://www.dailyrecord.co.uk/all-about/kilmarnock-fc\" target=\"_blank\" rel=\"noopener noreferrer\">Kilmarnock</a> to show their displeasure, which is less than ideal for Rodgers.</p><p>But his team will still be expected to inflict a first league defeat of the season on Stuart Kettlewell's men.</p><p>Kilmarnock: Stryjek, Brown, Mayo, Stanger, Deas, Thompson, Polworth, McKenzie, Watson, Daniels, Dackers Subs: Beach, Williams, Kiltie, Anderson, Thomson, Watkins, Ellis, Schilte-Brown, Traynor</p><p>Celtic: Schmeichel, Donovan, Carter-Vickers, Scales, Saracchi, McGregor, Hatate, Nygren, Balikwisha, Tounekti, Maeda Subs: Sinisalo, Yang, McCowan, Engels, Iheanacho, Bernardo, Murray, Forrest, Tierney</p><p>Record Sport will have all the action from Ayrshire LIVE on the blog.</p>",
            "cats": "Celtic FC",
            "image": "https://i2-prod.dailyrecord.co.uk/incoming/article35900423.ece/ALTERNATES/s1200/0_CelticDee1.png"
        },
        {
            "source": "GlasgowWorld Celtic",
            "title": "Premier League clubs &#039;lining up&#039; to poach Celtic boss Rodgers as reasons behind Rangers summer transfer emerge",
            "link": "https://www.glasgowworld.com/sport/football/celtic/brendan-rodgers-celtic-premier-league-rangers-transfer-news-hamza-igamane-5316507",
            "date": 1757847620,
            "desc": "<p>Here are the latest Celtic transfer news and Rangers transfer news headlines.</p>",
            "cats": "Celtic, Football, Sport",
            "image": "fleg.jpg"
        },
        {
            "source": "The Scotsman Celtic",
            "title": "Telling twist in Premiership title odds after Hearts&#039; seismic win over Rangers",
            "link": "https://www.scotsman.com/sport/football/scottish-premiership/latest-premiership-news/telling-twist-in-premiership-title-odds-after-hearts-seismic-win-over-rangers-5316563",
            "date": 1757845497,
            "desc": "<p>Jambos now second favourites for league after ending Ibrox hoodoo</p>",
            "cats": "Latest Premiership News, Scottish Premiership, Football, Sport",
            "image": "fleg.jpg"
        },
        {
            "source": "The Scotsman Celtic",
            "title": "Celtic star reveals he is ready for &#039;next steps&#039; as verdict given on Brendan Rodgers",
            "link": "https://www.scotsman.com/sport/football/celtic/latest-celtic-news/celtic-star-reveals-he-is-ready-for-next-steps-as-verdict-given-on-brendan-rodgers-5316072",
            "date": 1757835014,
            "desc": "<p>McCowan eyes more starts and goal involvements in his second season at Parkhead</p>",
            "cats": "Latest Celtic News, Celtic, Football, Sport",
            "image": "fleg.jpg"
        },
        {
            "source": "GlasgowWorld Celtic",
            "title": "Celtic could face triple conundrum over summer signing trio this winter as stars may miss next Rangers clash",
            "link": "https://www.glasgowworld.com/sport/football/celtic/celtic-could-triple-conundrum-summer-signing-trio-this-winter-miss-rangers-5313522",
            "date": 1757833207,
            "desc": "<p>Celtic signed three players this summer but all three could be gone between the end of December and start of January.</p>",
            "cats": "Celtic, Football, Sport",
            "image": "fleg.jpg"
        },
        {
            "source": "GlasgowWorld Celtic",
            "title": "Celtic boss Brendan Rodgers delivers press conference all-timer, ex Rangers ace reveals who made him into a £10m star",
            "link": "https://www.glasgowworld.com/sport/football/celtic/celtic-boss-brendan-rodgers-press-conference-rangers-ace-ps10m-star-5316376",
            "date": 1757829654,
            "desc": "<p>The latest news from both Celtic and Rangers as turmoil surrounds both Glasgow clubs</p>",
            "cats": "Celtic, Football, Sport",
            "image": "fleg.jpg"
        },
        {
            "source": "Daily Record - Celtic FC",
            "title": "Celtic dealmaker reveals Dermot Desmond suspicion he was wrong about as ex rebel in disbelief over rift",
            "link": "https://www.dailyrecord.co.uk/sport/football/football-news/celtic-dealmaker-reveals-dermot-desmond-35898215",
            "date": 1757826000,
            "desc": "<p>06:00, 14 Sep 2025</p><p>Brian Dempsey still gets stopped by <a href=\"https://www.dailyrecord.co.uk/all-about/celtic-fc\" target=\"_blank\" rel=\"noopener noreferrer\">Celtic</a> fans who tell him they were there on the night, three decades ago, when he stood outside the ground’s front door and uttered the words that sealed the takeover of the club.</p><p>“The game is over. The rebels have won.”</p><p>But the former director, <a href=\"https://www.dailyrecord.co.uk/sport/football/football-news/fergus-mccann-saved-celtic-how-11855104\" target=\"_blank\" rel=\"noopener noreferrer\">who brought Fergus McCann to Scotland to save Celtic from closure in 1994,</a> never forgets the part that <a href=\"https://www.dailyrecord.co.uk/all-about/dermot-desmond\" target=\"_blank\" rel=\"noopener noreferrer\">Dermot Desmond</a> – now the club’s principal shareholder – played in the creation of history.</p><p>“I have to be honest and say my original thought was that Dermot might be an opportunist,” he told me. “But I was wrong.</p><p>“The deal to remove the two families, the Kellys and the Whites, who controlled the club could have been done without Dermot but it couldn’t have been completed properly without his input of cash.</p><p>“He consummated the arrangement. That is why I look on with sadness and in disbelief at what is happening now between Celtic and the supporters of the club.</p><p>“When an institution like Celtic loses the goodwill of the fans then they are in trouble. They need to get it back quickly by being honest, sincere and genuine.</p><p>“And the most urgent need is to convince the fans that the Celtic hierarchy does have ambition.</p><p>“I would struggle to understand how the board can continue to oversee a situation where there is a lack of mutual respect between the club and the fans.</p><p>“I would never refer to the Celtic support as the customer base because they’re not customers.</p><p>“They are people who, over the 30 years since the takeover, have put tens of millions of pounds into Celtic and who make personal sacrifices to go on doing so.</p><p>“The club are financially indebted to them and must never forget that.</p><p>“The fans are now, as they were in 1994, the ones who make Celtic a viable company with their relentless purchase of season tickets, merchandising and everything else on offer from the club.</p><p>“And yet we have come to a situation where there will be an organised <a href=\"https://www.dailyrecord.co.uk/sport/football/football-news/celtic-fans-confirm-12th-man-35890411\" target=\"_blank\" rel=\"noopener noreferrer\">boycott of the first 12 minutes of the game against Kilmarnoc</a>k.</p><p>“And how ironic is it that the opposition happens to be <a href=\"https://www.dailyrecord.co.uk/all-about/kilmarnock-fc\" target=\"_blank\" rel=\"noopener noreferrer\">Kilmarnock</a>.</p><p>“The last game Celtic played in 1994 before the takeover campaign got into full swing was against Kilmarnock at Celtic Park, when disillusionment had reached the stage where the crowd was only 10,000 strong.</p><p>“The Celtic fans are the salt of the earth and the club must never overlook that fact.</p><p>“To have a feel for Celtic you have to understand the depth of feeling for the club that exists among families who go without in order to back the club to the hilt.</p><p>“They know the club is theirs because it is in their minds, their hearts and their pockets.”</p><p><a href=\"https://www.dailyrecord.co.uk/all-about/brendan-rodgers\" target=\"_blank\" rel=\"noopener noreferrer\">Brendan Rodgers</a> spoke about meeting a 77-year-old man prior to kick-off in the Champions League play-off tie against Kairat Almaty in Kazakhstan.</p><p>And it is that emotional pull between club and supporters that Dempsey doesn’t want to see eroded. While also expressing sympathy for the manager after he was briefed against by someone inside the club who was party to a story that Rodgers was trying to “engineer” his own exit from Celtic Park.</p><p>Dempsey said: “I don’t know Brendan personally but I would find it reprehensible that a story could be planted to discredit him.</p><p>“He should have demanded a showdown with his employers and asked them face-to-face what was going on. Brendan has been an integral part of Celtic’s success in recent years and deserved better treatment on a personal level.</p><p>“Whether it is the principal shareholder or the chairman and the chief executive, they have to be true to themselves by being true to Celtic.</p><p>“The supporters, by their overwhelming vote of no confidence in the board, clearly feel they have been failed by the hierarchy and fear that Celtic have lost their way.</p><p>“The inability to qualify for the <a href=\"https://www.dailyrecord.co.uk/all-about/champions-league\" target=\"_blank\" rel=\"noopener noreferrer\">Champions League</a> and the unsatisfactory transfer window that has left the fans in uproar does add up to failure.</p><p>“This situation is not irretrievable if you really do want to make amends for what has happened.</p><p>“But it has to start by having proper dialogue with the supporters. And that begins by saying to them: ‘I’m sorry.’</p><p>“If it was me, I’d have walked into the centre-circle at Celtic Park in front of 60,000 people and said those words to demonstrate my contrition.</p><p>“In adversity there is opportunity – as was proven to be the case in 1994.</p><p>“Now Celtic must take steps to repair the loss of trust that has arisen between people who should all be pulling in the same direction for the sake of the club.”</p>",
            "cats": "Celtic FC",
            "image": "https://i2-prod.dailyrecord.co.uk/article34844451.ece/ALTERNATES/s1200/1_Celtic-v-St-Mirren-Cinch-Premiership.jpg"
        },
        {
            "source": "Daily Record - Celtic FC",
            "title": "The view from inside Celtic dressing room on fan protests as an incomparable leader stands tall",
            "link": "https://www.dailyrecord.co.uk/sport/football/football-news/view-inside-celtic-dressing-room-35897053",
            "date": 1757818800,
            "desc": "<p>04:00, 14 Sep 2025</p><p>Celtic's 12th man might not be inside Rugby Park when John Beaton gets proceedings underway this afternoon.</p><p>But <a href=\"https://www.dailyrecord.co.uk/all-about/luke-mccowan\" target=\"_blank\" rel=\"noopener noreferrer\">Luke McCowan</a> insists it’s up to the 11 players <a href=\"https://www.dailyrecord.co.uk/all-about/brendan-rodgers\" target=\"_blank\" rel=\"noopener noreferrer\">Brendan Rodgers</a> sends out to face Kilmarnock to bring their own noise - and silence the home support.</p><p>Having turned the volume up in their protests against the Parkhead board in recent weeks, furious Hoops fans plan to leave the Chadwick Stand sitting in an empty silence for the first 12 minutes of this afternoon’s encounter.</p><p>The decibels in the away end will no doubt sky rocket after that. But McCowan is hopeful by then the Hoops will already have found their roar.</p><p>Despite the frenzied clamour engulfing the Parkhead hierarchy over the <a href=\"https://www.dailyrecord.co.uk/all-about/champions-league\" target=\"_blank\" rel=\"noopener noreferrer\">Champions League</a> qualifying disaster and transfer window flop McCowan is adamant the players are focused on producing on the park.</p><p>He insists the off-field aggro hasn’t fed into the dressing room. And even if it had then the players are professional enough to handle the pressure.</p><p>But for all his confidence that his team mates are ready for the challenge, the 27-year-old still accepts it’s going to be a strange start to proceedings in Ayrshire.</p><p>He said: “It will, it'll be a lot quieter. I'm sure the Killie fans will be singing and us players will just need to bring our atmosphere that we always do.</p><p>“Hopefully after the 12th minute it'll be loud again and the players can just focus on the game. From the first minute onwards, that'll be the message I'm sure from the gaffer and all the players.</p><p>“You've got to know that at big clubs like Celtic situations like this might arise.</p><p>“But the players that are within the team need to be focused on matches, on the training and just being a player.</p><p>“Don't think you're any bigger than that.</p><p>“You leave the guys in the shirt and ties to deal with all that business and let us guys that have got the boots on take care of that side.</p><p>“You know a team like Kilmarnock it doesn't matter what form you're in you can go down there and they can bring a real tough challenge.</p><p>“The pitch itself brings a real tough challenge but there's no excuses for us. It’s knowing your demands, knowing your standards and going in there with a positive attitude.”</p><p>That’s a message that will, as always, be driven home by skipper <a href=\"https://www.dailyrecord.co.uk/all-about/callum-mcgregor\" target=\"_blank\" rel=\"noopener noreferrer\">Callum McGregor</a> in the run up to kick off.</p><p>McCowan said: “Cal is was one of the best I've seen at that, with any outside noise just making sure all the players are focused on what you can control.</p><p>“There's no point in you thinking about what's going on on the outside when you've got passes to be made, shots to be taken, a style of play.</p><p>“That's what we'll focus on so we can bring a positive note to Sunday.</p><p>“There's so many leaders in that changing room, but you just know that's what Cal’s thoughts are and it resonates through the team.</p><p>“He doesn't have to say anything verbally, we all know there's things to be done in the league games.”</p><p>One of those things is addressing a growing issue in front of goal that’s seen Rodgers’ side fail to score in three of their last four outings.</p><p>That included a damaging 210 goalless minutes in the Champions League qualifying defeat to Kairat Almaty and the bore draw at Ibrox last time out.</p><p>Want-away Daizen Maeda is a shadow of his previous self while Adam Idah has departed.</p><p>Hoops fans might not be over the moon with the bargain basement signing of free agent Kelechi Iheanacho after the deadline passed.</p><p>But McCowan is confident the former Manchester City star along with fellow new signings Michel Ange Balikwisha and Sebastian Tounekti will soon be firing.</p><p>Asked if there’s a problem in front of goal, he said: “I don’t think so, that's part of the standards that this club and the players have set over the last however many years.</p><p>“It’s a team known for scoring an abundance of goals. You're always going to go through that patch and when you do it's about not getting bogged down and knowing that the quality of player is there.</p><p>“It’s just about getting the guys into the areas that we can impact.</p><p>“I’m sure at some point the chances will get taken and there will be many a goal scored because you can go from not scoring goals in say three or four games but then you can score five in one.</p><p>“That's the kind of club you're at. The three new guys have been brilliant, really bought into the mantra here of working really hard, they know the quality they can bring but they also know the quality they're coming into.</p><p>“I'm really excited for them to be honest, I'm excited to see the three of them perform and I'm sure the three of them will go and do well for this club.</p><p>“Right away from the first week we've been in they've got the message. They know the style of play that we want and what they're coming up against and I'm sure they're ready to put the work in.</p><p>“It's great to have someone of Kelechi’s calibre in the team.”</p><p>Goals are high on McCowan’s list of priority areas to improve too. He got off to a flier with the winning strike against St Mirren on flag day.</p><p>And he said: “Goal involvements is probably the biggest one as you want to feel like you're a big part of the squad by scoring goals or setting up goals.</p><p>“As a Celtic player now for over a year you want to be taking the next steps.</p><p>“That's going to be my main aim this year - trying to better what my stats were last year.”</p>",
            "cats": "Celtic FC",
            "image": "https://i2-prod.dailyrecord.co.uk/article35671225.ece/ALTERNATES/s1200/0_Celtic-v-St-Mirren-William-Hill-Premiership-Celtic-Park.jpg"
        },
        {
            "source": "The Scotsman Celtic",
            "title": "Celtic &#039;guys in the shirt&#039; message fired out as players told what not to get involved in",
            "link": "https://www.scotsman.com/sport/football/celtic/latest-celtic-news/celtic-guys-in-the-shirt-message-fired-out-as-players-told-what-not-to-get-involved-in-5316065",
            "date": 1757799047,
            "desc": "<p>Midfielder knows rancour off the pitch cannot seep into matters on it</p>",
            "cats": "Latest Celtic News, Celtic, Football, Sport",
            "image": "fleg.jpg"
        },
        {
            "source": "Daily Record - Celtic FC",
            "title": "Luke McCowan rubbishes claims Celtic are &#039;not in good place&#039; ",
            "link": "https://www.dailyrecord.co.uk/sport/football/football-news/luke-mccowan-rubbishes-claims-celtic-35897020",
            "date": 1757799000,
            "desc": "<p>22:30, 13 Sep 2025</p><p>Luke McCowan has shot down claims that Celtic are toiling - insisting <a href=\"https://www.dailyrecord.co.uk/all-about/brendan-rodgers\" target=\"_blank\" rel=\"noopener noreferrer\">Brendan Rodgers</a>’ players ARE in a good place.</p><p><a href=\"https://www.dailyrecord.co.uk/all-about/kilmarnock-fc\" target=\"_blank\" rel=\"noopener noreferrer\">Kilmarnock</a> striker Djenairo Daniels stoked the fire ahead of Sunday's Rugby Park showdown by stating the Ayrshiremen are ready to exploit the escalating off-field feud between Hoops fans and the boardroom after a disastrous transfer window.</p><p>Rodgers himself has been targeted by a Parkhead insider who accused him of trying to engineer an exit and tearing the club apart - and hit back on Friday by calling for the guilty party to resign.</p><p>Further protests planned on Sunday will see sections of the away support stay out of Rugby Park for the opening 12 minutes.</p><p>And, speaking this week, Daniels said: “<a href=\"https://www.dailyrecord.co.uk/all-about/celtic-fc\" target=\"_blank\" rel=\"noopener noreferrer\">Celtic</a> are not really in a good place at the moment and we will take advantage of that.”</p><p>But McCowan insists the champions are rock solid and have nothing to prove - and take pride in the start they’ve made to the league campaign.</p><p>He said: “As players we're in a good place, joint top of the league (coming into the weekend) and started the league campaign well.</p><p>“It's not about proving anybody wrong or showing anybody that Celtic are in a good place.</p><p>“It’s about us players putting on a performance that after it you can have a nice chat about and know that, ok there's been a lot of noise but the players there are putting that to bed quite early. Go and show with a good performance that that’s all it is - noise.</p><p>“The players need to go and perform regardless of what's happening on the outside and need to go and search for the three points. The main focus is on the challenge on Sunday.</p><p>“You've got to take great pride in how we’ve started. We’ve not lost a goal and were sitting joint top going into the weekend so can go down there with great confidence.”</p><p>McCowan admits tumbling out of the <a href=\"https://www.dailyrecord.co.uk/all-about/champions-league\" target=\"_blank\" rel=\"noopener noreferrer\">Champions League</a> in a qualifying humbling to Kairat Almaty was a huge disappointment.</p><p>But the former Dundee man is confident Celtic will bounce back and ensure the season is a success.</p><p>He said: “Yeah, 100 per cent, we’re fighting on four different fronts. Obviously the disappointment of coming out of the Champions League was always going to be a massive blow.</p><p>“But you've got another competition there that you can go and do incredibly well in.</p><p>“It’s just about putting full focus on that, drawing a line, getting over it and making sure that the next competitions that you're playing in you're putting a great performance in, a top level performance and I'm sure we will.”</p><p>Rodgers made his intentions clear to see out the season when he faced the media on Friday and even hinted at wanting to stay longer - if the club was aligned with his ambitions.</p><p>McCowan would love an extended working relationship with a boss he says has taken his game to another level.</p><p>He said: “Massive, he just makes you want to play for him, makes you feel 10 feet tall and puts a lot of confidence into you.</p><p>“Now I know what it takes to play for Celtic, he says you need to go and show that.</p><p>“So yeah he just puts an abundance of confidence into myself and throughout the squad as well.</p><p>“As players you've just got to focus on what you can do in training and what you can bring to the games.</p><p>“The fans can voice their opinions on what they want to do.</p><p>“As players we've just got to bring positive energy to what comes to the games, to training, putting the work in and just keep the controllables in check.”</p>",
            "cats": "Celtic FC",
            "image": "https://i2-prod.dailyrecord.co.uk/article35667529.ece/ALTERNATES/s1200/0_JS377002760.jpg"
        },
        {
            "source": "BBC Sport",
            "title": "Are Celtic facing a crossroads already this season?",
            "link": "https://www.bbc.com/sport/football/articles/cqjevnkkvq9o?at_medium=RSS&at_campaign=rss",
            "date": 1757796188,
            "desc": "<p>With the clock ticking down on deadline day, Celtic ended up paying over £5m for Tounekti.</p><p>Adam Idah was sold despite clear assurances that the striker would be going nowhere until a suitable replacement was secured. Instead, free agent Kelechi Iheanacho was signed up after the window closed.</p><p>Asked prior to the long trip to Almaty what would get his players back to their usual levels \"competition,\" came the quickfire reply from Rodgers.</p><p>Not coaching, not cajoling, not training. Competition.</p><p>The manager has been asking for it since the turn of the year. The sale of Kyogo Furuhashi with no thought for a replacement is still a puzzler eight months on.</p><p>Some £30m had been spent on Idah, Arne Engels, Auston Trusty and Paulo Bernardo in the previous summer.</p><p>This time round, Rodgers wanted quality, not quantity. What he got was the return of Kieran Tierney and a decent looking forward in Benjamin Nygren along with several \"club signings\" that he has largely overlooked.</p><p>Tounekti, Iheanacho, Balikwisha and Marcelo Saracchi may yet prove to be worthwhile additions but arrived once the Champions League horse had bolted.</p><p>You then have regular performer Daizen Maeda looking a shadow of himself after a summer move was blocked.</p>",
            "cats": "",
            "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7c51/live/c94e92a0-90dc-11f0-84c8-99de564f0440.jpg"
        },
        {
            "source": "GlasgowWorld Celtic",
            "title": "Brendan Rodgers provides Celtic verdict on possible insider as Rangers offload three stars on loan through co-op scheme",
            "link": "https://www.glasgowworld.com/sport/football/celtic/brendan-rodgers-celtic-verdict-possible-insider-rangers-stars-5316345",
            "date": 1757790056,
            "desc": "<p>The latest news coming from both Celtic and Rangers as domestic football returns after the International break</p>",
            "cats": "Celtic, Football, Sport",
            "image": "fleg.jpg"
        },
        {
            "source": "Daily Record - Celtic FC",
            "title": "Brendan Rodgers remaining in Celtic dug-out is baffling - half of Glasgow can see who is perpetrator of cowardice ",
            "link": "https://www.dailyrecord.co.uk/sport/football/brendan-rodgers-remaining-celtic-dug-35898223",
            "date": 1757787123,
            "desc": "<p>19:12, 13 Sep 2025</p><p>Veteran sportswriter and broadcaster with a distinctive style. A boxing expert as well as a football writer and columnist for the Daily Record and Sunday Mail, Hugh also presents Clyde 1 FM’s Superscoreboard show.</p><p>I must admit I’m baffled why <a href=\"https://www.dailyrecord.co.uk/all-about/brendan-rodgers\" target=\"_blank\" rel=\"noopener noreferrer\">Brendan Rodgers</a> will be in the dugout when Celtic play at Kilmarnock.</p><p>The manager admitted at his <a href=\"https://www.dailyrecord.co.uk/sport/football/football-news/explosive-brendan-rodgers-celtic-press-35894972\" target=\"_blank\" rel=\"noopener noreferrer\">pre-match press conference on Friday</a> that he knew a newspaper story had been planted last weekend to discredit him.</p><p>And he revealed it isn’t the first time someone at the club he works for had briefed against him.</p><p>On the first occasion it happened, Rodgers felt so let down he left for Leicester City.</p><p>This time he accused the perpetrator of cowardice but then spoke about his willingness to extend his contract with <a href=\"https://www.dailyrecord.co.uk/all-about/celtic-fc\" target=\"_blank\" rel=\"noopener noreferrer\">Celtic</a> beyond this season.</p><p>I don’t follow the logic behind that line of thinking.</p><p>I need a behavioural psychologist to advise me why you would want to work for an organisation where a senior member of the hierarchy suggested, incorrectly as it turns out, that you were trying to engineer a way out of the club.</p><p>Rodgers might claim not to know the identity of the person who did the dirty on him – but half the city of Glasgow would, I imagine, be able to tell him on request.</p><p>The manager also used his press conference to catalogue a series of mistakes made with regard to transfers during the summer window that ended with Celtic signing two players, Michel-Ange Balikwisha and Seb Tounekti from Royal Antwerp and Hammarby, respectively.</p><p>But they only cost a combined total of £10million after an understrength Celtic had gone out of the <a href=\"https://www.dailyrecord.co.uk/all-about/champions-league\" target=\"_blank\" rel=\"noopener noreferrer\">Champions League</a> at the hands of Kairat Almaty in Kazakhstan, costing the club four times that amount of money in lost revenue</p><p>Rodgers went through Celtic’s Greatest Hits when it came to maladministration as it applied to recruitment and the treatment of players like <a href=\"https://www.dailyrecord.co.uk/all-about/daizen-maeda\" target=\"_blank\" rel=\"noopener noreferrer\">Daizen Maeda</a>, who has apparently been trying to get out of Celtic Park for the last six months but is suffering from the recruitment department’s dilatory response to finding a replacement, saying the cumulative effect of those failings had left him “empty”.</p><p>But not so empty he wouldn’t accept a new deal after the insertion of conditions that would allow him to work the best he can.</p><p>Presumably those conditions would involve the manager having a more hands-on approach when it came to transfer windows.</p><p>And the removal of the negative influence who has been spreading non-truths about him.</p><p>All will become clear in the next couple of weeks, apparently, which might mean there’s a high-profile removal on the way.</p><p>Perhaps Dermot Desmond, Celtic’s principal shareholder, will heed the advice of former director Brian Dempsey and get here quickly to explain what the hell is going on.</p><p>Where all of this leaves a mutinous support, set to break new ground in the field of toxicology at Rugby Park today, will only be known once they get there and stage their pre-planned forms of disruption.</p><p>They might, I suspect, have thought Rodgers could have been more supportive of them in their fight against whoever wrote what they described as last weekend’s “cold and clinical” statement concerning transfer policy.</p><p>The fans say the relationship between club and supporters has to be more than “transactional”.</p><p>Rodgers, though, gave them platitudes about coming together and fighting for one cause because that is the power of Celtic</p><p>It sounded like propping up the club’s current regime, regardless of how he has been treated on a personal level.</p><p>Nobody mentioned the football.</p><p>They will get round to that subject pretty quickly if Kilmarnock win on Sunday afternoon.</p><p>If you think the internal warfare is bad just now, you will have seen nothing yet, pandemonium-wise, if Killie deliver another humiliating blow.</p>",
            "cats": "Celtic FC",
            "image": "https://i2-prod.dailyrecord.co.uk/article35898210.ece/ALTERNATES/s1200/0_JS380744637.jpg"
        },
        {
            "source": "Glasgow Times | Celtic",
            "title": "How Brendan Rodgers has &#039;played a blinder&#039; as Celtic boss accused of deflection",
            "link": "https://www.glasgowtimes.co.uk/sport/25464524.rodgers-played-blinder-celtic-boss-accused-deflection/?ref=rss",
            "date": 1757762037,
            "desc": "<p>Rodgers held court during an explosive press conference yesterday in which he blasted the \"cowardly\" figure at <a href=\"https://www.glasgowtimes.co.uk/sport/celtic\" target=\"_blank\" rel=\"noopener noreferrer\">Celtic</a> who supposedly briefed against him to the media.</p><p>The Northern Irishman insists he would be happy to sign a new deal despite those leaks suggesting he was trying to work his exit from the club.</p><p>Celtic fans, furious at their club's handling of the transfer market, are planning a protest at tomorrow's game against Kilmarnock. They will not enter the ground until the 12th minute as they make a stand.</p><p>Boyd says Rodgers has expertly created a situation where the board are taking all the heat and he avoids flak for his role in failing to reach the Champions League proper.</p><p>\"Who’s kidding who?\", he asked in the <a href=\"https://www.thescottishsun.co.uk/sport/15335488/brendan-rodgers-celtic-fans-soap-opera-excuses-kris-boyd/?ref=ed_direct\" target=\"_blank\" rel=\"noopener noreferrer\">Scottish Sun</a>. \"There is more chance of me being the Celtic manager next season than him.</p><p>\"Rodgers denies trying to engineer an exit, but all this talk about aligning with the board and signing a contract extension is pie in the sky. That won’t happen. He will leave at the end of the season, if not before.</p><p>\"Rodgers knows his relationship with the club’s hierarchy is probably as fragile as it’s ever been. All is not rosy at Celtic, and the manager is playing a blinder in getting the diehard fans on his side.</p><p>\"Incidentally, are those supporters now backing him the same ones who chanted vile songs about him at Tynecastle when he did his disappearing act to Leicester City back in 2019? That’s all conveniently been forgotten about now and Rodgers has them eating out of the palm of his hand.</p><p>\"All the fury is being directed at the board, when so much of the blame for the Champions League exit should be pinned on the manager and his players.</p><p>\"It was good to see that Rodgers did finally take some responsibility for his team failing to score a goal against Kairat Almaty across 210 minutes in the play-off. It’s only taken him over a fortnight to do that, so credit where it’s due.\"</p><p>Boyd has also cast doubt on the claim that Rodgers has not been properly backed in the transfer market by club chiefs, with over £60million spent on players since his return.</p><p>He added: \"It still puzzles me how a manager who has spent north of £60million since returning to Celtic in 2023 gets such an easy ride from the Hoops support.</p><p>\"It’s a myth to say that Rodgers hasn’t been backed, and the squad he has at his disposal was more than good enough to win that tie.</p><p>\"They were up against a bang-average team from Kazakhstan and messed up. Plain and simple.</p><p>\"Yes, Celtic should have had a replacement for <a href=\"https://www.glasgowtimes.co.uk/topics/nicolas-kuhn/\" target=\"_blank\" rel=\"noopener noreferrer\">Nicolas Kuhn</a> in before that tie, but they weren’t playing PSG. No matter how much Rodgers moans about the timing of the signings, I’m just not buying his excuses.</p><p>\"The Celtic boss held court for over 30 minutes at Lennoxtown yesterday, but I would take a lot of what he said with a pinch of salt.\"</p>",
            "cats": "",
            "image": "https://www.glasgowtimes.co.uk/resources/images/19951594.jpg?type=og-image&xType=0&yType=0"
        },
        {
            "source": "Glasgow Times | Celtic",
            "title": "Celtic and Rangers target joins new club on season-long loan",
            "link": "https://www.glasgowtimes.co.uk/sport/25464457.celtic-rangers-target-joins-euro-club-season-long-loan/?ref=rss",
            "date": 1757758587,
            "desc": "<p>The Crystal Palace winger was wanted by both sides of Glasgow during the summer, Russell Martin the first to be linked with him after making a number of other signings from the English market.</p><p>The Ibrox side reportedly wanted a loan with an option to buy but the Eagles preferred to sell the player permanently.</p><p>Celtic were then linked towards the end of the window as <a href=\"https://www.glasgowtimes.co.uk/topics/brendan-rodgers/\" target=\"_blank\" rel=\"noopener noreferrer\">Brendan Rodgers</a> tried desperately to get more wingers and strikers in. He wanted two of each but ended up with just Sebastien Tounekti, plus free agent Kelechi Iheanacho after the deadline.</p><p>Read more:</p><p>Rak-Sakyi has now joined up with the Turkish Super Lig side for the rest of the season. Rizespor, who are third from bottom after three winless games, announced the signing today.</p><p>Thjey said: \"Our Çaykur Rizespor has added English footballer of Ghanaian descent Jesurun Rak-Sakyi to its squad on loan.</p><p>\"Following an agreement with Premier League club Crystal Palace and the player, the experienced player arrived in Rize and signed a one-year loan agreement.</p><p>\"We welcome our new transfer Rak-Sakyi, who has also had the opportunity to play for England's youth national teams, and wish him success.\"</p>",
            "cats": "",
            "image": "https://www.glasgowtimes.co.uk/resources/images/19951498.jpg?type=og-image&xType=0&yType=32"
        },
        {
            "source": "Glasgow Times | Celtic",
            "title": "Andy Payton: Former Celtic striker opens up on dementia diagnosis at 57",
            "link": "https://www.glasgowtimes.co.uk/sport/25464382.former-celtic-striker-opens-dementia-diagnosis-57/?ref=rss",
            "date": 1757753135,
            "desc": "<p>‘Bloody Magic’ is the headline on an image of his wounded head, vaseline plastered over a gash inflicted by the flailing right arm of <a href=\"https://www.heraldscotland.com/topics/rangers-fc/\" target=\"_blank\" rel=\"noopener noreferrer\">Rangers</a> left-back David Robertson. “I was elbowed in the head,” the former <a href=\"https://www.heraldscotland.com/topics/celtic-fc/\" target=\"_blank\" rel=\"noopener noreferrer\">Celtic</a> striker recalls now. “But back in the day you went off and got it stitched up and got straight back on.”</p><p>Minutes earlier Payton had thumped a John Collins corner into the net in a rare win over Rangers for Liam Brady’s Celtic team. A frantic, blood-and-thunder battle symptomatic of Old Firm games of the past Payton had signed from Middlesbrough for £600,000 a year earlier. A direct, physical, up and at ’em British centre forward, the cut and thrust of Scottish football seemed to suit him.</p><p>“Mark Hateley is in the background and what that picture reminds me of is the intensity of the Celtic and Rangers games back then,” he says.</p><p>“It was so much more physical than it is now. Rangers back then had Hateley, [Richard] Gough, Trevor Steven, Ally McCoist and John Brown and the players were literally kicking lumps out of each other. But any striker who goes to Celtic – whether it’s today or 30 years ago – knows that if they can score the winner against Rangers then that’s what it’s all about. That’s why, at that time, scoring the winner against Rangers felt like it was worth all the blood and the stitches.”</p><p>Recent events have given him cause to reconsider that judgement. Over the course of a 16-year career Payton scored 226 goals in 588 appearances for seven clubs. His first stop was Hull City, where he practiced heading drills, day in and day out, with former <a href=\"https://www.heraldscotland.com/local-news/aberdeen-news/\" target=\"_blank\" rel=\"noopener noreferrer\">Aberdeen</a> striker Dean Windass.</p><p>Earlier this year Windass was diagnosed with stage two dementia after he was persuaded to undergo a brain scan by his friend John Stiles – son of Nobby, the England World Cup winner who died after a long fight with the same illness.</p><p>Payton had kept in touch with his former team-mate on and off. When he confided in him over his own episodes of memory loss and the blinding headaches which forced him to seek refuge in a darkened room for hours on end, Windass urged him to have it checked out.</p><p>“It just didn’t feel right. Deano still lives in Hull and it’s a little bit like when you have mates at school and you keep in touch now and again. We’d exchanged messages on and off and he recognised the signs.</p><p>“I’m not one of those soft people who say, ‘I’ve got a bit of a headache…’ Some people have the slightest thing happen and they’re unwell, I’m not like that at all. We’re talking bad, a lot of pain and I had never had any health issues. That’s what led me to go for the brain scans and when they came back they revealed that out of the 60-plus tracts in the brain 27 showed damage. I can’t say I was surprised that I was diagnosed with early onset dementia because there had been little bits of memory loss. My missus had started to notice little signs.”</p><p>At Hull City heading drills were a daily ritual. Payton remembers sessions where he and Windass would head the ball 150 to 200 times in two hours. Crosses were fired in by wingers from the left and the right and holding back was discouraged.</p><p>The effects of heading footballs at high speed became clear when the FIELD study, led by the <a href=\"https://www.heraldscotland.com/topics/university-of-glasgow/\" target=\"_blank\" rel=\"noopener noreferrer\">University of Glasgow</a> in conjunction with the Football Association and Professional Footballer’s Association, studied data from 7676 former professional footballers and found that they were 3.5 times more likely to die from neurodegenerative disease. Former players were five times more likely to develop Alzheimer’s disease, four times more likely to develop Motor Neurone Disease and twice as likely to develop Parkinson’s.</p><p>The football associations of England, Scotland and Northern Ireland responded by banning children from heading balls in training, depending on their age. In 2022 the <a href=\"https://www.heraldscotland.com/topics/scottish-fa/\" target=\"_blank\" rel=\"noopener noreferrer\">Scottish FA</a> introduced new guidance banning professional players from heading the ball during training on both the day before and the day after a match.</p><p>When the likes of Stiles, Jack Charlton, Jeff Astle, Joe Kinnear, Jimmy Calderwood, Gordon McQueen, Billy McNeill and former Scotland manager Ally MacLeod played the game, safeguards were unheard of. Heading the ball freely, without inhibition, was a part of the working day.</p><p>“It’s beyond doubt, for me, that heading the ball as often as I did caused this,” says Payton now.</p><p>“It was so physical back in my day, even in training. You came up against the old-fashioned centre-halves and they would not only smash you, they would tell you they were going to do it just before they did.</p><p>“That day against Rangers I went off to get five stitches in my head. I went straight into the treatment room, got stitched up then went straight back on. Could you imagine that in football now?”</p><p>For the last 10 years Payton has worked as a part-time football coach at Burnley College, but frets over a future less certain than it used to be.</p><p>He supports Football Families for Justice, a voluntary organisation run by John Stiles, to support former footballers and their families. Fighting to raise awareness – and funds – for relatives left to address the crippling care home costs of ex-players FFJ believe the Football Brain Health Fund established by the English Premier League and PFA is shamefully inadequate.</p><p>Currently 33 former footballers are pursuing a joint legal action against the Football Association in the High Court for failing to protect them against chronic traumatic encephalopathy, dementia and other neurological conditions. Speaking at the end of the debate on the Football Governance Bill, Lisa Nandy, Secretary of State for Culture, Media and Sport promised to ‘get to grips’ with the issue after 303 former players – including Kevin Keegan and Graeme Souness – signed a letter calling on the government to force football to take the welfare of ex-players seriously.</p><p>“Care home costs are astronomical and it shouldn’t be the taxpayer meeting the cost of the care. It’s clear to me that there is not a proper fund that takes care of players and their families and there should be.</p><p>“I look at deadline day the other week when clubs spend £2.5 billion. And yet the PFA are putting just £1 million a year into a Brain Health Fund when they’re paying their chief executive (Maheta Molango) £650,000 a year. Start adding up care home costs and £1 million pays for what? Four players?”</p><p>While football clubs in England – and, to a lesser extent, Scotland – continue to throw millions of pounds at transfer deals and agents’ fees, sympathy for the players of yesteryear is diluted by a common misconception. While many lived in a nice semi in a suburb, owned a car and earned more than miners or steel workers or bus drivers the income of the average pro could still be measured in hundreds rather than thousands of pounds. Few, if any, earned the fortunes required to support the crippling cost of social care.</p><p>“Footballers of today can get a contract at 17 or 18 and be on £40k a week over five years before they’ve scored a goal for the first team,” Payton observes.</p><p>“At Hull City I was in the Championship at 19 and when I scored on my debut against Leeds United I was on £70 a week. And I brought £58 home after tax.</p><p>“I was at Celtic with people like Paul McStay, John Collins and Frank McAvennie and Charlie Nicholas.</p><p><em>(Image: SNS Group)</em></p><p>“Players of that calibre in the modern era would be multi-millionaires. I wouldn’t have been far behind myself, just going off the amount of goals I scored and where I scored them. But players in our era were nowhere near that. “And now that generation of players, including me, are having these problems and to me it’s beyond all reasonable doubt that heading a ball 200 times a day in training has caused this. The taxpayer shouldn’t be footing the bill for that.”</p><p>Scoring goals everywhere he played, regrets over his career are few. He wishes he’d headed the ball a good deal less and, in hindsight, feels he could have stayed at Celtic and fought for his place.</p><p>Liam Brady’s resignation in October 1993 paved the way for Lou Macari’s arrival, the dysfunctional decision making of the time was summed up by the new manager agreeing a deal with Barnsley to swap Payton for Wayne Biggins, a 33-year-old journeyman striker who made six appearances and failed to score a goal.</p><p>“Wayne came up and didn’t get any goals and I’d never want to call out a player, but that was Macari’s decision and I still managed to finish up top scorer that season.</p><p>“When you look at memories like playing for Celtic and scoring the winner in an Old Firm game and winning a golden boot for Burnley, my hometown club, those are magic moments.</p><p>“But they have come at a high price. Because a lot of players like myself are worried about what happens to us now.</p><p>“We didn’t know what heading a ball would do to us. And I would have taken a lot more precautions if I’d known I’d be in this situation now.</p><p>“Football could sort this out from loose change. I’m only 57 and I think there are 300 players in the same position. I hope, with me, it’s a slow burner. But when you have been for the scans and you’re being told half your brain is abnormal you don’t really know, do you?”</p>",
            "cats": "",
            "image": "https://www.glasgowtimes.co.uk/resources/images/19951407.jpg?type=og-image"
        },
        {
            "source": "Glasgow Times | Celtic",
            "title": "Why ex-Celtic manger Postecoglou has to bin Angeball to avoid Nottingham Forest sack",
            "link": "https://www.glasgowtimes.co.uk/sport/25464136.postecoglou-bin-angeball-avoid-nottingham-forest-sack/?ref=rss",
            "date": 1757743320,
            "desc": "<p>If <a href=\"https://www.heraldscotland.com/sport/25182504.ex-celtic-boss-postecoglou-leads-spurs-european-glory/?ref=ed_direct\" target=\"_blank\" rel=\"noopener noreferrer\">Tottenham Hotspur had retained Ange Postecoglou</a>’s services after they had lifted the <a href=\"https://www.heraldscotland.com/topics/europa-league/\" target=\"_blank\" rel=\"noopener noreferrer\">Europa League</a> back in May then we would maybe know now if the game plan which <a href=\"https://www.heraldscotland.com/sport/uk-sport/25452751.nottingham-forest-appoint-former-tottenham-boss-ange-postecoglou/?ref=ed_direct\" target=\"_blank\" rel=\"noopener noreferrer\">the Greek-Australian</a> deployed in the final against Manchester United was a one-off experiment or the new norm.</p><p>There was a final Premier League game against Brighton at the Tottenham Stadium a few days after the narrow 1-0 triumph over their hapless (and hopeless) Old Trafford adversaries in the San Mames Stadium in Bilbao.</p><p>But that dead rubber, which the hosts lost 4-1, was really just another opportunity for jubilant Spurs fans to celebrate their boys winning their first trophy in 17 years and their first piece of European silverware in 41 years.</p><p>Those meaningless 90 minutes offered no insight, none whatsoever, into how Postecoglou intended to approach matches in the wake of the greatest accomplishment of his long and varied coaching career.</p><p>Would his sides revert to pressing their opponents high up the pitch, trying to dominate possession and looking to entertain punters with attractive and offensive football?</p><p>Read more:</p><p>Or would they continue, as they had done against United in the Europa League final, to sit deep, concentrate on defending their penalty box and look to get forward on the counter?</p><p>Those were questions which many fans and pundits in English football – who had lauded and derided the <a href=\"https://www.heraldscotland.com/sport/football/23566053.ange-postecoglou-refuses-commit-future-celtic-treble/?ref=ed_direct\" target=\"_blank\" rel=\"noopener noreferrer\">former Celtic manager</a>’s swashbuckling tactics in equal measure during his eventful two year reign in North London – wanted answered following the Spanish sojurn.</p><p>They will, with Postecoglou replacing Nuno Espirito Santo at Nottingham Forest this week, get their wish now. It will be fascinating seeing if Big Ange intends to stick to his long-held beliefs or if he feels he needs to temper his attacking instincts somewhat to flourish in the Premier League and Europa League. It could go either way.</p><p>But it is to hoped that Angeball - as the high-intensity, high-risk football which he favours was labelled during his trophy-laden spell in Scotland – is finally consigned to history and a far more pragmatic style of play introduced both at home and abroad. His survival at the City Ground depends on it.&nbsp;&nbsp;&nbsp;&nbsp;</p><p>The former South Melbourne, Brisbane Roar, Melbourne Victory, Australia and Yokohama F Marinos manager was adored by <a href=\"https://www.heraldscotland.com/topics/celtic-fc/\" target=\"_blank\" rel=\"noopener noreferrer\">Celtic</a> supporters when he was in situ in the East End Glasgow. After, that is, he had overcome a rocky start which saw many unimpressed and impatient agitators demand that he be sacked.</p><p>He signed sensationally well, brought in the likes of Cameron Carter-Vickers, Joe Hart, <a href=\"https://www.heraldscotland.com/topics/kyogo-furuhashi/\" target=\"_blank\" rel=\"noopener noreferrer\">Kyogo Furuhashi</a>, Reo Hatate, Matt O’Riley, Jota and Alistair Johnston. His teams played “The Celtic Way” and blew their domestic rivals, including <a href=\"https://www.heraldscotland.com/topics/rangers-fc/\" target=\"_blank\" rel=\"noopener noreferrer\">Rangers</a>, away. He oversaw a league and cup double and then a world record eighth domestic treble.&nbsp;&nbsp;</p><p>But in continental competition his teams regularly looked, not to put too fine a point on it, naïve. They lost to Midtjylland of Denmark and failed to reach the <a href=\"https://www.heraldscotland.com/topics/champions-league/\" target=\"_blank\" rel=\"noopener noreferrer\">Champions League</a> group stages shortly after he arrived. That very much set the tone for what was to follow. They were hammered 4-0 at home by Bayer Leverkusen in the Europa League group stage and 3-1 on their own turf by Bodo/Glimt in the Conference League play-offs.</p><p>Shrewd supporters choked on their pre-match hot dogs when the teams were announced before that latter outing. O’Riley and Tom Rogic in the same starting line-up? It was little surprise when Hugo Vetlesen was given time and space just outside the hosts area in only the sixth minute and allowed to tee up Runar Espejord for the opener.</p><p>The Scottish champions were showered with plaudits for the way they acquitted themselves against Real Madrid, RB Leipzig and Shakhtar Donetsk when they returned to the Champions League proper in the 2022/23 season. But they failed to win a single game and finished bottom of their section.</p><p>This correspondent feared the worst when Postecoglou was headhunted by Spurs following that campaign. Building play from the back, pushing full-backs upfield and infield, relying on quick, intricate passing to unlock defences and adopting a high line is all well and good against St Johnstone at Parkhead in the Premiership. But how would it work against Chelsea at Stamford Bridge, Newcastle United at St James’s Park, Liverpool at Anfield?</p><p>Read more:</p><p>For a while, to be fair to him, it functioned pretty well. Fifth place in the English top flight was a respectable finish for an Antipodean who was new to the English game. But last term he, foolishly, arrogantly, nonsensically, insisted on persevering with his go-for-broke, gung-ho game despite having a crippling injury list. It was no great surprise really when his paymasters decided Thomas Frank would be a safer pair of hands.&nbsp;</p><p>The 60-year-old is a big personality who will not be fazed at life in the dugout at double European Cup winners Forest. If anything, he will positively revel in the spotlight. But if he wants to be renowned more for his coaching than his snappy soundbites he needs to curb his natural tendencies and show a far greater appreciation of the realities of the modern game.</p><p>His predecessor turned one of the English game’s fallen giants from relegation fodder into Champions League contenders by being defensive. He oversaw victories over Liverpool, Manchester United, Manchester City and indeed Spurs by urging his men to sit back, soak up pressure and strike on the counter attack.</p><p>Can Postecoglou do better against much larger and far wealthier rivals, improve on a stellar season and satisfy the demands of mercurial owner Evangelos Marinakis in the coming months by ripping things up and trying to implement Angeball? He will find he has to retire to that Greek island far earlier than he had planned to if he does.</p>",
            "cats": "",
            "image": "https://www.glasgowtimes.co.uk/resources/images/19951031.jpg?type=og-image"
        },
        {
            "source": "BBC Sport",
            "title": "Rodgers calls for &#039;cowardly&#039; insider to leave Celtic",
            "link": "https://www.bbc.com/sport/football/articles/c62nk52n221o?at_medium=RSS&at_campaign=rss",
            "date": 1757696422,
            "desc": "<p>\"My honest take is I thought it was a cowardly action by whoever it is,\" said Rodgers.</p><p>\"It's not something you'd want. Certainly my relationships with the guys, I am close with here within the board, I would struggle to understand why.</p><p>\"All I've tried to do is drive the club forward. Was I surprised by it? Not really.</p><p>\"I'm thick skinned and it's because I want to do so well here. I'm determined.</p><p>\"I know Dermot [Desmond, majority shareholder], Michael [Nicholson, chief executive], the guys I work with on a daily basis, certainly communicate on a daily basis, feel the same.\"</p><p>In the report by the Scottish Sun, there was no hint as to where the leak had come from, other than it said senior figures were concerned the former Liverpool boss, who previously left his role at Celtic midway through his third season, had eyes on an exit.</p><p>There was also a claim his public frustrations about the club's transfer dealings had \"torn the club apart\".</p><p>When asked on Friday if the person who was speaking against him should resign, Rodgers added: \"I don't think there's any doubt.</p><p>\"If you're sat in the position that I'm in with the weight of the club on your shoulders to be the spokesperson, to be the manager, be the psychologist and be everything, it's so important you feel supported.</p><p>\"I'm pretty sure there will be some questioned asked on it as, like I said, there was quite a bit of detail in there - and wrong I may add.\"</p>",
            "cats": "",
            "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/990d/live/eea37d60-8fe5-11f0-b391-6936825093bd.jpg"
        },
        {
            "source": "Latest Celtic F.C. News | News, updates, and analysis related to Celtic Football Club. | STV News",
            "title": "Rodgers hits out at anonymous ‘coward’ who said he wanted Celtic exit",
            "link": "https://news.stv.tv/sport/football/rodgers-hits-out-at-anonymous-coward-who-said-he-wanted-celtic-exit",
            "date": 1757693388,
            "desc": "<p><strong>Brendan Rodgers has hit out at the “cowardly actions” of a club insider who told the media that he was engineering a move away from Parkhead.</strong></p><p>The Celtic manager says he was “disappointed” at the anonymous comments but insists it makes him even more determined to succeed.</p><p>When asked about it at his press conference, Rodgers said: “It was interesting when I was shown that. My honest opinion is that it was a cowardly action by whoever it is.</p><p>“It’s not something that you would want, and, certainly, with my relationship with the guys I am close with on the board, I would struggle to understand why.</p><p>“Because, since I have been here, firstly in 2016 and then for my second stint, all I have tried to do is drive the club forward.</p><p>“So it is disappointing when something like that comes out, and like I say, it’s a cowardly action, but it just makes me more determined to succeed.</p><p>“It’s not what you want to wake up on a Saturday and be shown. And I think the people who know me well, know my affinity for here, they know what I want.</p><p>“But they also know I don’t sit comfortable and if someone wants to sit comfortable and be happy with what they’ve got, then I’m the wrong manager to facilitate that because I’ll always demand that continual improvement.</p><p>“I want this club to succeed but for that, if I’m sat comfortable, then it’s not going to work. So I have to get uncomfortable and that means I have to then ask questions that maybe people don’t like – but that’s my job.”</p><p>Asked if there should be an investigation into who was responsible for the story, Rodgers said: “I don’t think there’s any doubt.</p><p>“I think if you’re sat in the position that I’m in with the weight of the club on your shoulders, it’s so important that you feel supported.</p><p>“And I think that if anyone is briefing against that person when they know they could come and speak to me at any time, I’m here from early morning to late in the evening, or come to my house or do whatever.</p><p>“Listen, we all will have frustrations at times in our life and especially at Celtic where we’ve always got something.</p><p>“But – and it’s no disrespect to you guys (the media) – I would never ever think of going to bring that to the fore to hurt someone else, especially when that someone else is trying to give everything to the club.</p><p>“So, yeah, I’m pretty sure there will be some questions asked on it because there was quite a bit of detail in there – and wrong, I may add. But hopefully we’ll find out.”</p><p>Rodgers also declared that he would “100%” be open to extending his Celtic contract despite being left feeling “empty” following an underwhelming summer transfer window.</p><p>The manager has made no secret of his frustration at the club’s failure to improve the squad before they crashed out of the Champions League at the hands of Kairat Almaty a fortnight ago.</p><p>Celtic fans are planning protests against the board as a result of their summer of woe, and it has been widely speculated that the situation would prompt Rodgers to walk out on the club before or upon expiry of his contract at the end of this season.</p><p>However, the 52-year-old, who was speaking on Friday for the first time since the window closed, revealed he had never entertained thoughts of leaving Parkhead for a second time and was “hopeful” of extending his deal – if the conditions were right.</p><p>When pressed on whether this summer had influenced his thinking with regard to remaining at the club beyond this season, Rodgers said: “No, it hasn’t really changed from the last time.</p><p>“I would love to stay here longer. I’ve had informal chats with Dermot (Desmond, the majority shareholder) and Michael (Nicholson, chief executive).</p><p>“I haven’t had an offer yet to think over, and until that comes, then I’m not going to be so arrogant to say, ‘yeah, I want to be here for another three years’. The club might not want me here.</p><p>“So I have to respect that, and until that happens. Then I just continue to do my job.</p><p>“And if going forward, if I do get offered a deal, then of course there needs to be conditions within that allow me to work to the best I possibly can. If not, then it’s maybe just there’s two philosophies that don’t quite add up and I also accept that.</p><p>“I’ll go away, I’ll be a Celtic supporter for the rest of my life, and we’ll go our separate ways. But my hope was to come back here, to take the club forward.</p><p>“We’ve seen progress, we’ve seen Europe, we’ve seen everything – so can we sustain that? It hasn’t quite happened for us in the Champions League, but I’m hopeful that in the future something can be resolved.”</p><p>Get all the latest news from around the country</p><p>Scan the QR code on your mobile device for all the latest news from around the country</p>",
            "cats": "Football, Sport",
            "image": "https://news.stv.tv/wp-content/uploads/2025/05/e969963239e908ff0a9c217b6a29d2d0-1747575832-social-sport.jpg"
        },
        {
            "source": "BBC Sport",
            "title": "Rodgers must convince want-away Maeda to &#039;go again&#039;",
            "link": "https://www.bbc.com/sport/articles/cd72eynyqjwo?at_medium=RSS&at_campaign=rss",
            "date": 1757690797,
            "desc": "<p>Brendan Rodgers says he has \"known since the end of February\" that Daizen Maeda wanted to leave Celtic.</p><p>But the manager believes the Japan forward will continue to give his all despite failing to secure a move away during the summer.</p><p>Maeda has scored 63 goals and contributed a further 30 assists since joining Celtic in 2022.</p><p>The 27-year-old told Japanese media last week he wanted to leave, but had a potential transfer blocked by Celtic before the deadline passed.</p><p>When asked about Maeda's comment, Rodgers said: \"I wasn't surprised by that, because I've known since the end of February where Daizen was at.</p><p>\"We spoke a lot and he's continued to give everything in his game and his training. He had a few options to go and it would have been great for him and his family in terms of his life, but it didn't materialise, so it's now my job to convince him to go again.</p><p>\"I've done that with players before. I had Luis Suarez nearly at the end of my first season [at Liverpool] when it was deemed he was going to Arsenal. I had to convince him to stay and then he ended up having an amazing season and then after that went to Barcelona, so it's not new to my career.</p><p>\"Players will have challenges but I think everyone sees the integrity in how Daizen works, how he plays. If I can reconnect all of that again then I'm pretty sure he will give his all.\"</p><p>Rodgers added that Celtic should have been in a position to grant last season's PFA Scotland player of the year his wish.</p><p>\"I still feel that if a player does want to move on then we have to be prepared for that,\" he said.</p><p>\"In this window we clearly weren't prepared for it. It just couldn't happen but my feelings are still the same.</p><p>\"Especially if you've got a player who's been here for years giving his absolute all and he wants to have another challenge before maybe going back to Japan, then that was maybe the right thing for him.</p><p>\"But certainly the position we were in and it being so late, we couldn't make that happen for him sadly.\"</p>",
            "cats": "",
            "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f7c9/live/eca6b110-8fe7-11f0-b391-6936825093bd.jpg"
        },
        {
            "source": "GlasgowLive - Celtic FC",
            "title": "Brendan Rodgers slams faceless Celtic &#039;coward&#039; as transfer window left him feeling &#039;empty&#039;",
            "link": "https://www.glasgowlive.co.uk/sport/brendan-rodgers-slams-faceless-celtic-32465696",
            "date": 1757685917,
            "desc": "<p>Brendan Rodgers has slammed the faceless \"coward\" who briefed the media on the <a href=\"https://www.glasgowlive.co.uk/all-about/celtic-fc\" target=\"_blank\" rel=\"noopener noreferrer\">Celtic </a>boss apparently trying to engineer his exit from the club - and revealed it's happened before.</p><p>A report emerged claiming that Rodgers wanted out of Parkhead after a disastrous transfer window saw the Hoops fail to strengthen as much as fans and Rodgers was hoping for, reports <a href=\"https://www.dailyrecord.co.uk/sport/football/football-news/brendan-rodgers-blasts-faceless-celtic-35894096?int_source=breaking-news\" target=\"_blank\" rel=\"noopener noreferrer\">Daily Record Sport. </a></p><p>A club \"insider\" was quoted claiming that senior officials suspected Rodgers was working his ticket out of Glasgow and now he as admitted that briefings against him have come as no surprise.</p><p>He said: \"It was interesting when I was shown that. My honest take? I thought it was a cowardly action from whoever it is.</p><p>\"Was I surprised by it? Not really. I was briefed upon the last time I was here, when I left, and now that I've come back.</p><p>\"I don't think there's any doubt. If you are sitting where I am with the weight I have on my shoulders, it's so important to feel supported. Whoever is briefing, they can come here and speak to me at any time.</p><p>\"We all will have frustrations at times in our life, but I would never think of going and bringing that to the fore to hurt someone else. Especially someone who didn't have to come back but wanted to come back.\"</p><p>Rodgers was asked if he knew who it was, he said, \"No.\"</p><p>Last weekend's statement regarding the transfer window left the Hoops faithful fuming as the anonymous 1000 word address seemed to blame everyone else for the club's failings in the market.</p><p>That's led to an angry response from punters, who are boycotting the club's <a href=\"https://www.glasgowlive.co.uk/sport/celtic-fans-learn-europa-league-32450745\" target=\"_blank\" rel=\"noopener noreferrer\">Europa League ticket packages</a> that were announced this week.</p><p>Sign up to our daily Glasgow Live <a href=\"https://www.glasgowlive.co.uk/newsletter-preference-centre/?view=Solus&amp;amp;mailingListId=55d1ffc4-e8f1-4bd2-83e1-4aab8f24e9b7&amp;amp;utm_source=solusarticle\" target=\"_blank\" rel=\"noopener noreferrer\">newsletter here</a> to receive news and features direct to your inbox.</p><p>Rodgers admits the way the window unfolded has left him feeling \"empty,\" but insists he's focused on getting the team back to the levels demanded by fans depsite not getting what he wanted during the window.</p><p>\"The business model of the club is highly successful,\" he said. \"What we have to marry that in with is the football. Not just investment, timing of investment.</p><p>\"It was clear what we needed, and we needed it early. We had these qualification games. Summer 2025 was a critical window for us to get players in to be ready for these games, and we weren't ready.</p><p>\"That made me leave last time. This time I won't do that, one hundred per cent. I said 150 per cent a few weeks ago, so I'll go back to that! It didn't make me think of walking way, I just felt empty, if I'm honest.\"</p><p>As for the statement and fan reaction, Riodgers wasn't willing to take the hit for Parkhead hierarchy but equally wasn't willing to turn on his superiors either.</p><p>\"The club put out a statement and I'm not here to answer those questions because they are not mine,\" he said. \"Over the coming weeks, it will become clear how that evolves.</p><p>\"I'm not here to tell supporters how to feel. I know it, I feel it because I grew up with it, I know that the demands are. Supporters want to see the club develop not just domestically, we have to be looking to perform better in Europe.</p><p>\"The quality of your life is the quality of your communication. After this summer that is something the club will most definitely look at. My thoughts currently are purely on getting the team back playing with our identity again.</p><p>\"My job as the manager this is the situation I'm now in. I've never been more determined to succeed now the window is shut this season. In fact, it's my duty.</p><p>\"I'm glad the window is shut, there's a really good spirit in the team. There's been a lot of uncertainty and instability; we accept it could have been better for us but now it's behind us.</p><p>\"My job as manager is to pull everything together and get us moving again. We have to accept and take responsibility that the window wasn't what we wanted. I believe we have talented players in the squad. It is what it is, you cannot look back on it now.\"</p><p>As for the sale of Adam Idah on deadline day without having a replacement lined up, Rodgers suggested that one was in the works but fell through, and talked up the arrival of Kelechi Inheancho on a free transfer.</p><p>He added: \"Adam was a player who hadn't asked to leave. Swansea wanted him around same time as other possibilities could have happened for us. We didn't want to lose him. It looked as though it would be one out, one in, but that didn't happen for whatever reason.</p><p>\"Kelechi (Iheanacho) is robust and has genuine talent.\"</p><p>Join <a href=\"https://www.glasgowlive.co.uk/news/glasgow-news/join-glasgow-lives-whatsapp-community-27849764\" target=\"_blank\" rel=\"noopener noreferrer\">Glasgow Live&apos;s WhatsApp community here</a> and get the latest news sent straight to your messages.</p>",
            "cats": "Celtic FC",
            "image": "https://i2-prod.glasgowlive.co.uk/incoming/article32465836.ece/ALTERNATES/s1200/0_Celtic-v-Livingston-William-Hill-Premiership.jpg"
        },
        {
            "source": "Latest Celtic F.C. News | News, updates, and analysis related to Celtic Football Club. | STV News",
            "title": "Brendan Rodgers: I’m not here to tell Celtic supporters how to feel",
            "link": "https://news.stv.tv/sport/football/brendan-rodgers-im-not-here-to-tell-celtic-supporters-how-to-feel",
            "date": 1757684104,
            "desc": "<p><strong>Brendan Rodgers says he is “not here to tell supporters how to feel” amid planned protests against the board this weekend.</strong></p><p>But the manager insists the club must learn from mistakes made in the summer and look to constantly progress and strengthen the squad.</p><p>Fans are planning to stay outside the stadium for the first 12 minutes of their game against Kilmarnock at Rugby Park as a result of discontent from the perceived failings of the transfer window and failure to reach the Champions League.</p><p>Rodgers says he can understand the frustrations and urged the club to keep up with growing expectations, particularly on the European stage.</p><p>Speaking to the media on Friday, he said: “The club put out a statement, I’m not here to answer those questions because they are not mine, that will be something that I’m sure will become clear over the coming weeks with how that evolves.</p><p>“I’m not here to tell supporters how to feel, they feel frustrated and they will have every right to feel that.</p><p>“My job is to drive the team and the club forward as much as I possibly can.</p><p>“When I came in here in 2016, the treble had only been won three times, from then I looked to elevate the mentality and standards of this football club, and over the course of nine years the expectation is now to win a treble every season.</p><p>“The combination of that drive and demand that comes from the supporters, I know because I feel it and I grew up with it, so I understand what the demands are and that will continue.</p><p>“This club has huge potential, the size, the support base that we have, the history of the club and the supporters want to see the club continue to develop.</p><p>Brendan Rodgers has hit out at claims that he his attempting to ‘engineer an exit’ from Celtic. The manager has made no secret of his frustration at the club’s failure to improve the squad before they crashed out of the Champions League at the hands of Kairat Almaty a fortnight ago. Celtic fans are planning protests against the board as a result of their summer of woe and it had been widely speculated that the situation would prompt Rodgers to walk out on the club before or upon expiry of his contract at the end of this season. <a href=\"https://www.tiktok.com/tag/sport?refer=embed\" target=\"_blank\" rel=\"noopener noreferrer\">#sport</a> <a href=\"https://www.tiktok.com/tag/football?refer=embed\" target=\"_blank\" rel=\"noopener noreferrer\">#football</a> <a href=\"https://www.tiktok.com/tag/news?refer=embed\" target=\"_blank\" rel=\"noopener noreferrer\">#news</a> <a href=\"https://www.tiktok.com/tag/shorts?refer=embed\" target=\"_blank\" rel=\"noopener noreferrer\">#shorts</a> <a href=\"https://www.tiktok.com/tag/celtic?refer=embed\" target=\"_blank\" rel=\"noopener noreferrer\">#celtic</a> <a href=\"https://www.tiktok.com/tag/sports?refer=embed\" target=\"_blank\" rel=\"noopener noreferrer\">#sports</a></p><p>“Not just domestically, the club have done that and that is always your bread and butter, of course, but we have to perform and be more consistent in Europe.</p><p>“The summer transfer window was a critical window for us, to get players in and recycle the squad, we had to be able to do it early so we were ready for these games, and we weren’t ready. It’s as simple as that.</p><p>“So, now can we learn from that? We have to, because if not, the cycle will just continue.</p><p>“It never made me consider walking away, I just felt empty, If I’m honest. It was a long process, and when the weight in your shoulders and it doesn’t quite go the way you want, then of course, you have an empty feeling.</p><p>“But, as one of the leaders of the club, and particularly the manager of the team, you’ve got to get your head around it and you have to deal with it and maximise what you have.”</p><p>Get all the latest news from around the country</p><p>Scan the QR code on your mobile device for all the latest news from around the country</p>",
            "cats": "Football, Sport",
            "image": "https://news.stv.tv/wp-content/uploads/2025/07/9ad5da111d22a983654d74ce6b16c654-1753870088-social-sport.jpg"
        },
        {
            "source": "Latest Celtic F.C. News | News, updates, and analysis related to Celtic Football Club. | STV News",
            "title": "Callum McGregor hoping team can make fans ‘proud’ again amid ‘unprecedented’ discontent",
            "link": "https://news.stv.tv/sport/football/callum-mcgregor-hoping-team-can-make-fans-proud-again-amid-unprecedented-discontent",
            "date": 1757682657,
            "desc": "<p><strong>Celtic captain Callum McGregor says the team will be aiming to get the fans back onside and make them “proud” of the club again amid levels of discontent that is “unprecedented in recent times”.</strong></p><p>The Hoops return to league action against Kilmarnock on Sunday, with several fan groups set to protest against the board by not entering the stadium until the 12th minute.</p><p>And while McGregor admits he understands the frustrations, he insists they can help bring a feel-good factor back by performing well and winning games.</p><p>When asked about the planned protests, he said: “We haven’t really spoken about it as a group. Obviously, some of the boys will be aware of it, maybe some of the foreign lads not so much.</p><p>“The only thing we can control is that when we go onto the pitch, then it’s our intensity and our tempo that will impact the game.</p><p>“Obviously we would love the supporters to be in from the beginning, I understand the frustrations, which is fine because everyone has their opinion and has their own voice, the only thing we can control is the players on the pitch and hopefully we arrive into that game in the best way possible.</p><p>“We can also try to give the supporters some energy by our performances, by starting well, and then hopefully everything will start to pick up and come to life a little bit.</p><p>“We can’t be affected by what’s happening off the pitch and let it affect our performance, because then it starts to snowball. We have to draw a line under it and get back to functioning and attacking in the way we want to.</p><p>“It’s the supporters that make the club what it is, they are putting their hard-earned money into the club, so of course I understand that they want to see the best possible team on the park.</p><p>“We all want to be at the highest level possible every year.</p><p>“It’s unprecedented in recent times, the level of noise and discontent amongst the supporters, all we can do is try to give them a team that they can be proud of and back on the pitch.”</p><p>A large part of the fans’ anger stems from what was seen as a disappointing end to the transfer window, which saw players leave without being adequately replaced.</p><p>But McGregor has been impressed by the new recruits and is confident that they can hit the ground running.</p><p>Speaking to the media on Friday, he said: “I think the squad is strong enough, having seen what I’ve seen this week in training, there is a real hunger and real desire from the guys that have come in.</p><p>“And they are actually at a good level as well. We have added some real pace and penetration at the top end, we’ve added a top striker, albeit he’s not played so much recently, but the early signs are good, he looks good, he looks hungry to be part of what we are doing here.</p><p>“So, I’ve been really encouraged by what I’ve seen in the last seven or eight training sessions over the break.</p><p>“Starting on Sunday, if we play well and start to gather some momentum then I think this team will really start to come together.”</p><p>Get all the latest news from around the country</p><p>Scan the QR code on your mobile device for all the latest news from around the country</p>",
            "cats": "Football, Sport",
            "image": "https://news.stv.tv/wp-content/uploads/2024/11/cc102d3638b4a85db58fb431f5480ec9-1730894129-social-sport.jpg"
        },
        {
            "source": "BBC Sport",
            "title": "Big game at Ibrox, spotlight on Rodgers & stardust at Pittodrie?",
            "link": "https://www.bbc.com/sport/football/articles/ckgen85150lo?at_medium=RSS&at_campaign=rss",
            "date": 1757679049,
            "desc": "<p>Aberdeen go into Saturday's home fixture with Livingston rooted to the foot of the table, losing three straight games without scoring.</p><p>However, spirits raised among the Dons support with a statement end to the transfer window.</p><p>Striker Kevin Nisbet was brought back on a permanent deal, with Scotland team-mate Stuart Armstrong also joining.</p><p>But perhaps the most eye-catching acquisition across the league on deadline day was the loan signing of Bologna winger Jesper Karlsson.</p><p>The 27-year-old, who has 14 caps for Sweden, excelled under manager Jimmy Thelin at Elfsborg before earning a move to AZ Alkmaar.</p><p>After scoring 46 goals and assisting 33 with the Dutch top-flight side, the forward sealed a reported £10m switch to Serie A two years ago.</p><p>Things have not quite worked out at Bologna for Karlsson, who spent the second half of last season on loan at Lecce.</p><p>But, on paper, the Swede still has the potential to be an outstanding signing for a Dons side in desperate need of attacking inspiration.</p>",
            "cats": "",
            "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/12c6/live/247015f0-8e62-11f0-84c8-99de564f0440.png"
        },
        {
            "source": "BBC Sport",
            "title": "Swans&#039; Idah has point to prove after Celtic exit ",
            "link": "https://www.bbc.com/sport/football/articles/c0m4w94vy44o?at_medium=RSS&at_campaign=rss",
            "date": 1757674888,
            "desc": "<p>They eventually landed Idah on deadline day, with the Cork-born player becoming Swansea's most expensive signing outside the Premier League.</p><p>\"I think everybody knew that we wanted to strengthen our nine competition,\" Sheehan added.</p><p>\"So to bring in somebody of his calibre, his physicality, his athleticism, his mentality to come here - we were delighted with that.</p><p>\"He's a player that I know a lot about, my coaching staff know a lot about, so when the opportunity came to have conversations it was a no-brainer really and credit to the ownership that fully backed that.\"</p><p>Idah could make his Swansea debut against Hull City on Saturday (15:00 BST), having trained with his new team-mates for the first time on Thursday after being away on international duty with the Republic of Ireland.</p>",
            "cats": "",
            "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bb3d/live/5ede86e0-8fc0-11f0-bfd7-a51a4cf13c94.jpg"
        },
        {
            "source": "GlasgowLive - Celtic FC",
            "title": "Fuming Celtic fans plan protest at Kilmarnock as ‘sack the board’ campaign escalates",
            "link": "https://www.glasgowlive.co.uk/news/glasgow-news/fuming-celtic-fans-plan-protest-32459000",
            "date": 1757603730,
            "desc": "<p>Furious <a href=\"https://www.glasgowlive.co.uk/all-about/celtic-fc \" target=\"_blank\" rel=\"noopener noreferrer\">Celtic</a> fans have revealed plans for a mass protest at the Hoops’ next <a href=\"https://www.glasgowlive.co.uk/sport/football/ \" target=\"_blank\" rel=\"noopener noreferrer\">match</a> in Kilmarnock on Sunday (September 14).</p><p>Fans are to launch the next stage of their “escalatory campaign” against the Celtic board with a late-entry protest at Rugby Park. A large section of Celtic’s support are fuming about the club’s performance—or lack thereof—in the summer transfer window.</p><p>And the fans’ anger was stoked when Celtic crashed out of the Champions League play-off to Kazakh outfit Kairat Almaty. Fans chanted “sack the board” during the following game at <a href=\"https://www.glasgowlive.co.uk/all-about/celtic-park \" target=\"_blank\" rel=\"noopener noreferrer\">Parkhead</a>.</p><p>The Parkhead club released a 1000-word statement which explained their transfer business – but not to the supporters’ satisfaction. Winger Sebastian Tounekti arrived at Celtic and Adam Idah departed for Swansea City on transfer deadline day, after which free agent, Kelechi Iheanacho, who was released from Sevilla, was recruited.</p><p>An open letter to the club demanding answers for “repeated failures in transfer dealings” among other complaints, led by Celtic fans groups including the Green Brigade, Bhoys Celtic and the Celtic Trust, garnered more than 400 signatories.</p><p>Celtic travel to Rugby Park in the William Hill Premiership on Sunday as club football returns after the international break and a statement released on the Celtic Trust official X account revealed the next steps fans will take.</p><p>The joint statement from fans’ groups read: “Yesterday evening, a consultation meeting was held with the signatories of the recent open letter to Celtic FC. The open letter has still to be addressed by Celtic FC despite it representing tens of thousands of Celtic fans.</p><p>“The consultation meeting reflected the second step of acting as a collective fan movement for positive change at our club and was attended by 85 in the room and 175 online. Comprehensive minutes will soon be shared with all signatories.</p><p>“At the meeting, there was an overwhelming consensus on the following points which were compounded by a fan survey of 38,832 Celtic fans in advance of the meeting: to build on the recent ‘no confidence’ votes on the Celtic FC board, seeking the removal of Michael Nicholson, CEO; Chris McKay, CFO; Peter Lawwell, Chairman.</p><p>“To build a strategic, escalatory campaign against the Celtic board. To build a democratic and representative fan body</p><p>“To coordinate a ‘late entry’ protest at Kilmarnock v Celtic to further visualise and vocalise fan discontent. To help progress these points and the fan movement generally, a steering group of volunteers is being assembled.</p><p>“Finally, we would like to thank all who have participated in the process so far. It is natural that there will be a mix of feeling regarding some actions or inaction, however the most important consideration at this stage is maintaining, building and utilising broad fan support.”</p><p>Join <a href=\"https://www.glasgowlive.co.uk/news/glasgow-news/join-glasgow-lives-whatsapp-community-27849764\" target=\"_blank\" rel=\"noopener noreferrer\">Glasgow Live&apos;s WhatsApp community here</a> and get the latest news sent straight to your messages.</p><p>Sign up to our daily Glasgow Live <a href=\"https://www.glasgowlive.co.uk/newsletter-preference-centre/?view=Solus&amp;amp;mailingListId=55d1ffc4-e8f1-4bd2-83e1-4aab8f24e9b7&amp;amp;utm_source=solusarticle\" target=\"_blank\" rel=\"noopener noreferrer\">newsletter here</a> to receive news and features direct to your inbox.</p>",
            "cats": "Celtic FC",
            "image": "https://i2-prod.glasgowlive.co.uk/incoming/article32459030.ece/ALTERNATES/s1200/0_featureimage.jpg"
        },
        {
            "source": "Latest Celtic F.C. News | News, updates, and analysis related to Celtic Football Club. | STV News",
            "title": "Celtic supporters unite to plan ‘escalating campaign’ against Parkhead board",
            "link": "https://news.stv.tv/sport/celtic-supporters-unite-to-plan-escalating-campaign-against-parkhead-board",
            "date": 1757593301,
            "desc": "<p><strong>Celtic fans intend to escalate their protests against the board’s running of the club, with plans including taking action when the team faces Kilmarnock this weekend.</strong></p><p>Fans are being encouraged to stay away from the start of the televised Premiership match against Kilmarnock and wait until the 12th minute to make a late entry to Sunday’s game to highlight how unhappy they are with the Celtic hierarchy.</p><p>Supporters have made their anger known about the club’s transfer business, and the running of the football department, after a failure to significantly strengthen the first team during the summer window.</p><p>Though 12 new signings were made, fans are frustrated by the level of new recruits, a failure to replace some departed players, and how that was a factor in Celtic being knocked out of the Champions League by Kairat Almaty.</p><p>Chants of “sack the board” have already been heard through Celtic Park, and the North Curve Celtic group shared a photograph of themselves holding up banners calling for the removal of major shareholder Dermot Desmond, chairman Peter Lawwell, and chief executive Michael Nicholson.</p><p>In response to the criticism and an open letter signed by hundreds of supporters’ groups that questioned the leadership, Celtic issued a statement defending the club for not “throwing money at transfers”.</p><p>The club claimed information reported in the media about transfers was misleading or inaccurate, and also said that UEFA rules on financial fair play limited the club’s ability to spend their significant cash reserves on signings.</p><p>That drew derision from some fans online, and prompted a vote of no confidence in the board from a number of prominent supporters’ groups.</p><p>After a meeting of representatives from 260 different supporters clubs, groups and fan media organisations who had signed the open letter, a statement was circulated that outlined plans to “escalate” a campaign against the board.</p><p>It read: “Yesterday evening, a consultation meeting was held with the signatories of the recent open letter to Celtic FC. The open letter has still to be addressed by Celtic FC despite it representing tens of thousands of Celtic fans.</p><p>“The consultation meeting reflected the second step of acting as a collective fan movement for positive change at our club and was attended by 85 in the room and 175 online. Comprehensive minutes will soon be shared with all signatories.</p><p>“At the meeting, there was an overwhelming consensus on the following points which were compounded by a fan survey of 38,832 Celtic fans in advance of the meeting:</p><p>“To help progress these points and the fan movement generally, a steering group of volunteers is being assembled.</p><p>“Finally, we would like to thank all who have participated in the process so far. It is natural that there will be a mix of feeling regarding some actions or inaction, however the most important consideration at this stage is maintaining, building and utilising broad fan support.”</p><p>The Celtic support had grown increasingly unhappy throughout the summer at what they perceived as an unacceptable and frustrating lack of high-profile signings arriving.</p><p>Though forwards Callum Osmand and Shin Yamada were brought in, neither was considered to be a ready replacement and first team starter to replace Kyogo Furuhashi, who was sold in January. Numerous strikers were linked with the club but deals did not materialise and the striker situation came to a head when Celtic allowed Adam Idah, who had been signed for £9m the previous year, to travel to Swansea City ahead of a proposed move.</p><p>Manager Brendan Rodgers said Idah wouldn’t be sold without a replacement being signed but the Republic of Ireland forward completed his switch to Wales before Celtic’s late moves for a striker were unsuccessful. Kelechi Iheanacho signed for the club after the transfer deadline, having been released from his contract with Sevilla the previous day.</p><p>Winger Nicholas Kuhn was sold to Como early in the window for a significant fee, but wide players Michel -Ange Balikwisha and Sebastian Tounekti weren’t signed until after the Champions League exit. Yang was allowed to travel to Birmingham City to seal a move south but is back with the Celtic squad after a move collapsed.</p><p>The return of Kieran Tierney and the signing of midfielder Benjamin Nygren have been seen as positives but the remaining additions do not look likely to be regular inclusions in Rodgers’ side.</p><p>The manager has also been an increasingly frustrated figure throughout the summer and repeatedly underlined his insistence that the team needed quality additions to progress to the next level after reaching the knockout rounds of the Champions League last season.</p><p>The situation is also likely to affect Rodgers’ situation with the Northern Irishman’s contract expiring next summer and the manager having said that his ambition would need to be matched by the club if he was to remain beyond his initial three-year deal.</p><p>Get all the latest news from around the country</p><p>Scan the QR code on your mobile device for all the latest news from around the country</p>",
            "cats": "Football, Sport",
            "image": "https://news.stv.tv/wp-content/uploads/2025/09/23450c6019707c5f645b85fecb406957-1757591411-social-sport.jpg"
        },
        {
            "source": "GlasgowLive - Celtic FC",
            "title": "Celtic fans learn Europa League ticket prices as club offer &#039;cheapest package&#039; in Britain",
            "link": "https://www.glasgowlive.co.uk/sport/celtic-fans-learn-europa-league-32450745",
            "date": 1757514822,
            "desc": "<p>The prices for <a href=\"https://www.glasgowlive.co.uk/all-about/celtic-fc\" target=\"_blank\" rel=\"noopener noreferrer\">Celtic&apos;s</a> home Europa League fixtures have been revealed – and it's understood it's the cheapest four-match package in Britain so far.</p><p>The Hoops get their <a href=\"https://www.glasgowlive.co.uk/all-about/europa-league\" target=\"_blank\" rel=\"noopener noreferrer\">Euro league</a> phase campaign started away to Red Star Belgrade in two weeks' time before their first home tie against Braga on Thursday, October 2.</p><p>It wasn't exactly where they wanted to be when they set off on their Champions League qualifying campaign last month but fans only need to look back to blockbuster Parkhead wins over Real Betis, Lille and RB Leipzig in this competition to see it's no scant consolation prize, reports <a href=\"https://www.dailyrecord.co.uk/sport/football/celtic-fans-learn-europa-league-35881764\" target=\"_blank\" rel=\"noopener noreferrer\">Daily Record Sport. </a></p><p>Now punters have learned how much it will cost them for this year's four home ties with Braga, Sturm Graz, Roma and Utrecht.</p><p>The four-match package available to season ticket holders for those games costs £140 – an average of £35 per match.</p><p>That's understood to be the cheapest in the UK so far, notably lower than rivals Rangers whose prices range from £42-£47 for their four home ties individually. Aston Villa's package, meanwhile, is £144 while Nottingham Forest's come in at £170.</p><p>Season ticket holders can buy them up until 5pm on Thursday, September 18.</p><p>If you needed a reminder, here is the full run of Celtic's Europa League fixtures, with the home matches included in the package in bold.</p><p>Matchday 1 - Crvena Zvezda - Wednesday September 24 (A) 8pm</p><p>Matchday 2 - Braga - Thursday October 2 (H) 5.45PM</p><p>Matchday 3 - Sturm Graz - Thursday October 23 (H) 8PM</p><p>Matchday 4 - Midtjylland - Thursday November 6 (A) 5.45pm</p><p>Matchday 5 - Feyenoord - Thursday November 27 (A) 5.45PM</p><p>Matchday 6 - Roma - Thursday December 11 (H) 8PM</p><p>Matchday 7 - Bologna - Thursday January 22 (A) 5.45PM</p><p>Matchday 8 - Utrecht - Thursday Janaury 29 (H) 8pm</p><p>Join <a href=\"https://www.glasgowlive.co.uk/news/glasgow-news/join-glasgow-lives-whatsapp-community-27849764\" target=\"_blank\" rel=\"noopener noreferrer\">Glasgow Live&apos;s WhatsApp community here</a> and get the latest news sent straight to your messages.</p><p>Sign up to our daily Glasgow Live <a href=\"https://www.glasgowlive.co.uk/newsletter-preference-centre/?view=Solus&amp;amp;mailingListId=55d1ffc4-e8f1-4bd2-83e1-4aab8f24e9b7&amp;amp;utm_source=solusarticle\" target=\"_blank\" rel=\"noopener noreferrer\">newsletter here</a> to receive news and features direct to your inbox.</p>",
            "cats": "Celtic FC",
            "image": "https://i2-prod.glasgowlive.co.uk/incoming/article32450921.ece/ALTERNATES/s1200/0_Celtic-v-Kairat-Almaty-UEFA-Champions-League-Play-offs-Round-First-Leg.jpg"
        }
    ]
}